{"class_name": "Model", "keras_version": "2.0.8", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "config": {"sparse": false, "dtype": "int32", "batch_input_shape": [null, 120], "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "Embedding", "config": {"output_dim": 100, "input_dim": 20000, "batch_input_shape": [null, 120], "input_length": 120, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "dtype": "float32", "trainable": false, "mask_zero": false, "activity_regularizer": null, "embeddings_constraint": null, "embeddings_regularizer": null, "name": "embedding_1"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "embedding_1"}, {"class_name": "Conv1D", "config": {"activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1], "kernel_size": [5], "bias_constraint": null, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 120, "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1], "name": "conv1d_1"}, "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "name": "conv1d_1"}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "padding": "valid", "pool_size": [3], "strides": [3], "name": "max_pooling1d_1"}, "inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "name": "max_pooling1d_1"}, {"class_name": "Conv1D", "config": {"activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1], "kernel_size": [5], "bias_constraint": null, "bias_regularizer": null, "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "filters": 120, "padding": "valid", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "strides": [1], "name": "conv1d_2"}, "inbound_nodes": [[["max_pooling1d_1", 0, 0, {}]]], "name": "conv1d_2"}, {"class_name": "MaxPooling1D", "config": {"trainable": true, "padding": "valid", "pool_size": [3], "strides": [3], "name": "max_pooling1d_2"}, "inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "name": "max_pooling1d_2"}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}, "inbound_nodes": [[["max_pooling1d_2", 0, 0, {}]]], "name": "flatten_1"}, {"class_name": "Dense", "config": {"activation": "elu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "units": 120, "bias_regularizer": null, "name": "dense_1"}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1"}, {"class_name": "Dense", "config": {"activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "trainable": true, "units": 3, "bias_regularizer": null, "name": "dense_2"}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "dense_2"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_2", 0, 0]], "name": "model_1"}}